ttepatti/Car-Hacking-Village-Badges/2019_Car_Hacking_Village_Badge/CHV DC27 SUV SDK Rev 1/Software/MK64FN1M0xxx12_Project/drivers/fsl_sdhc.h
/*! @brief Interrupt status flag mask */
enum _sdhc_interrupt_status_flag
{
    kSDHC_CommandCompleteFlag    = SDHC_IRQSTAT_CC_MASK,    /*!< Command complete */
    kSDHC_DataCompleteFlag       = SDHC_IRQSTAT_TC_MASK,    /*!< Data complete */
    kSDHC_BlockGapEventFlag      = SDHC_IRQSTAT_BGE_MASK,   /*!< Block gap event */
    kSDHC_DmaCompleteFlag        = SDHC_IRQSTAT_DINT_MASK,  /*!< DMA interrupt */
    kSDHC_BufferWriteReadyFlag   = SDHC_IRQSTAT_BWR_MASK,   /*!< Buffer write ready */
    kSDHC_BufferReadReadyFlag    = SDHC_IRQSTAT_BRR_MASK,   /*!< Buffer read ready */
    kSDHC_CardInsertionFlag      = SDHC_IRQSTAT_CINS_MASK,  /*!< Card inserted */
    kSDHC_CardRemovalFlag        = SDHC_IRQSTAT_CRM_MASK,   /*!< Card removed */
    kSDHC_CardInterruptFlag      = SDHC_IRQSTAT_CINT_MASK,  /*!< Card interrupt */
    kSDHC_CommandTimeoutFlag     = SDHC_IRQSTAT_CTOE_MASK,  /*!< Command timeout error */
    kSDHC_CommandCrcErrorFlag    = SDHC_IRQSTAT_CCE_MASK,   /*!< Command CRC error */
    kSDHC_CommandEndBitErrorFlag = SDHC_IRQSTAT_CEBE_MASK,  /*!< Command end bit error */
    kSDHC_CommandIndexErrorFlag  = SDHC_IRQSTAT_CIE_MASK,   /*!< Command index error */
    kSDHC_DataTimeoutFlag        = SDHC_IRQSTAT_DTOE_MASK,  /*!< Data timeout error */
    kSDHC_DataCrcErrorFlag       = SDHC_IRQSTAT_DCE_MASK,   /*!< Data CRC error */
    kSDHC_DataEndBitErrorFlag    = SDHC_IRQSTAT_DEBE_MASK,  /*!< Data end bit error */
    kSDHC_AutoCommand12ErrorFlag = SDHC_IRQSTAT_AC12E_MASK, /*!< Auto CMD12 error */
    kSDHC_DmaErrorFlag           = SDHC_IRQSTAT_DMAE_MASK,  /*!< DMA error */

    kSDHC_CommandErrorFlag = (kSDHC_CommandTimeoutFlag | kSDHC_CommandCrcErrorFlag | kSDHC_CommandEndBitErrorFlag |
                              kSDHC_CommandIndexErrorFlag), /*!< Command error */
    kSDHC_DataErrorFlag    = (kSDHC_DataTimeoutFlag | kSDHC_DataCrcErrorFlag | kSDHC_DataEndBitErrorFlag |
                           kSDHC_AutoCommand12ErrorFlag),                                      /*!< Data error */
    kSDHC_ErrorFlag        = (kSDHC_CommandErrorFlag | kSDHC_DataErrorFlag | kSDHC_DmaErrorFlag), /*!< All error */
    kSDHC_DataFlag         = (kSDHC_DataCompleteFlag | kSDHC_DmaCompleteFlag | kSDHC_BufferWriteReadyFlag |
                      kSDHC_BufferReadReadyFlag | kSDHC_DataErrorFlag | kSDHC_DmaErrorFlag), /*!< Data interrupts */
    kSDHC_CommandFlag      = (kSDHC_CommandErrorFlag | kSDHC_CommandCompleteFlag), /*!< Command interrupts */
    kSDHC_CardDetectFlag   = (kSDHC_CardInsertionFlag | kSDHC_CardRemovalFlag),    /*!< Card detection interrupts */

    kSDHC_AllInterruptFlags = (kSDHC_BlockGapEventFlag | kSDHC_CardInterruptFlag | kSDHC_CommandFlag | kSDHC_DataFlag |
                               kSDHC_ErrorFlag), /*!< All flags mask */
};

/*! @brief Auto CMD12 error status flag mask */
enum _sdhc_auto_command12_error_status_flag
{
    kSDHC_AutoCommand12NotExecutedFlag = SDHC_AC12ERR_AC12NE_MASK,    /*!< Not executed error */
    kSDHC_AutoCommand12TimeoutFlag     = SDHC_AC12ERR_AC12TOE_MASK,   /*!< Timeout error */
    kSDHC_AutoCommand12EndBitErrorFlag = SDHC_AC12ERR_AC12EBE_MASK,   /*!< End bit error */
    kSDHC_AutoCommand12CrcErrorFlag    = SDHC_AC12ERR_AC12CE_MASK,    /*!< CRC error */
    kSDHC_AutoCommand12IndexErrorFlag  = SDHC_AC12ERR_AC12IE_MASK,    /*!< Index error */
    kSDHC_AutoCommand12NotIssuedFlag   = SDHC_AC12ERR_CNIBAC12E_MASK, /*!< Not issued error */
};

/*! @brief ADMA error status flag mask */
enum _sdhc_adma_error_status_flag
{
    kSDHC_AdmaLenghMismatchFlag   = SDHC_ADMAES_ADMALME_MASK, /*!< Length mismatch error */
    kSDHC_AdmaDescriptorErrorFlag = SDHC_ADMAES_ADMADCE_MASK, /*!< Descriptor error */
};

/*!
 * @brief ADMA error state
 *
 * This state is the detail state when ADMA error has occurred.
 */
typedef enum _sdhc_adma_error_state
{
    kSDHC_AdmaErrorStateStopDma         = 0x00U, /*!< Stop DMA */
    kSDHC_AdmaErrorStateFetchDescriptor = 0x01U, /*!< Fetch descriptor */
    kSDHC_AdmaErrorStateChangeAddress   = 0x02U, /*!< Change address */
    kSDHC_AdmaErrorStateTransferData    = 0x03U, /*!< Transfer data */
} sdhc_adma_error_state_t;

/*! @brief Force event bit position */
enum _sdhc_force_event
{
    kSDHC_ForceEventAutoCommand12NotExecuted = SDHC_FEVT_AC12NE_MASK,    /*!< Auto CMD12 not executed error */
    kSDHC_ForceEventAutoCommand12Timeout     = SDHC_FEVT_AC12TOE_MASK,   /*!< Auto CMD12 timeout error */
    kSDHC_ForceEventAutoCommand12CrcError    = SDHC_FEVT_AC12CE_MASK,    /*!< Auto CMD12 CRC error */
    kSDHC_ForceEventEndBitError              = SDHC_FEVT_AC12EBE_MASK,   /*!< Auto CMD12 end bit error */
    kSDHC_ForceEventAutoCommand12IndexError  = SDHC_FEVT_AC12IE_MASK,    /*!< Auto CMD12 index error */
    kSDHC_ForceEventAutoCommand12NotIssued   = SDHC_FEVT_CNIBAC12E_MASK, /*!< Auto CMD12 not issued error */
    kSDHC_ForceEventCommandTimeout           = SDHC_FEVT_CTOE_MASK,      /*!< Command timeout error */
    kSDHC_ForceEventCommandCrcError          = SDHC_FEVT_CCE_MASK,       /*!< Command CRC error */
    kSDHC_ForceEventCommandEndBitError       = SDHC_FEVT_CEBE_MASK,      /*!< Command end bit error */
    kSDHC_ForceEventCommandIndexError        = SDHC_FEVT_CIE_MASK,       /*!< Command index error */
    kSDHC_ForceEventDataTimeout              = SDHC_FEVT_DTOE_MASK,      /*!< Data timeout error */
    kSDHC_ForceEventDataCrcError             = SDHC_FEVT_DCE_MASK,       /*!< Data CRC error */
    kSDHC_ForceEventDataEndBitError          = SDHC_FEVT_DEBE_MASK,      /*!< Data end bit error */
    kSDHC_ForceEventAutoCommand12Error       = SDHC_FEVT_AC12E_MASK,     /*!< Auto CMD12 error */
    kSDHC_ForceEventCardInt                  = (int)SDHC_FEVT_CINT_MASK, /*!< Card interrupt */
    kSDHC_ForceEventDmaError                 = SDHC_FEVT_DMAE_MASK,      /*!< Dma error */

    kSDHC_ForceEventsAll = (int)(SDHC_FEVT_AC12NE_MASK | SDHC_FEVT_AC12TOE_MASK | SDHC_FEVT_AC12CE_MASK |
                                 SDHC_FEVT_AC12EBE_MASK | SDHC_FEVT_AC12IE_MASK | SDHC_FEVT_CNIBAC12E_MASK |
                                 SDHC_FEVT_CTOE_MASK | SDHC_FEVT_CCE_MASK | SDHC_FEVT_CEBE_MASK | SDHC_FEVT_CIE_MASK |
                                 SDHC_FEVT_DTOE_MASK | SDHC_FEVT_DCE_MASK | SDHC_FEVT_DEBE_MASK | SDHC_FEVT_AC12E_MASK |
                                 SDHC_FEVT_CINT_MASK | SDHC_FEVT_DMAE_MASK), /*!< All force event flags mask */
};

/*! @brief Data transfer width */
typedef enum _sdhc_data_bus_width
{
    kSDHC_DataBusWidth1Bit = 0U, /*!< 1-bit mode */
    kSDHC_DataBusWidth4Bit = 1U, /*!< 4-bit mode */
    kSDHC_DataBusWidth8Bit = 2U, /*!< 8-bit mode */
} sdhc_data_bus_width_t;

